#include "HAL.h"
#include "EERTOS.h"
#include "button.h"


// Прототипы задач ============================================================
void Reaction(void);

// Global Variables

//RTOS Interrupt
ISR(RTOS_ISR)      // на втором таймере
{
sei();
TimerService();						// Прерывание ядра диспетчера
}
//..........................................................................


void Reaction(void)
{
if (bt1) { bt1=0; LED_PORT |=1<<LED0; }
if (bt2) { bt2=0; LED_PORT |=1<<LED1; }
if (bt3) { bt3=0; LED_PORT |=1<<LED2; }
if (bt4) { bt4=0; LED_PORT |=1<<LED3; }
if (bt5) { bt5=0; LED_PORT |=1<<LED4; }

if (bt_l)  { bt_l=0;  LED_PORT = 0;}
if (bt_l2) { bt_l2=0; LED_PORT = 0xFF;}

if (bt_al) { bt_al=0; LED_PORT |=1<<LED5;}

SetTimerTask(Reaction, 100);
}



//============================================================================
//Область задач
//============================================================================


//==============================================================================
int main(void)
{
InitAll();		// Инициализируем периферию
InitRTOS();		// Инициализируем ядро
RunRTOS();		// Старт ядра.


bt_scan();		// Запуск процедуры сканирования
Reaction();		// Запуск обработчика событий

while(1) 		// Главный цикл диспетчера
{
wdt_reset();	// Сброс собачьего таймера
TaskManager();	// Вызов диспетчера
}

return 0;
}



